package lesson_5_GIT;

//1 способ - копируем удаленный репозиторий к себе на ПК
// git init -> создаем в рабочей папке локальный репозиторий (GitBash)
// git clone ссылка_репозитория_к-й_копируем -> работаем в рабочей папке (GitBash)
// в IDEA создаем новый проект в рабочей папке. IDEA + GIT = взаимосвязь

//commit - это сохранение в локальный репо (кнопка с зеленой галочкой)
//push - отправка изменений на удаленный репо

//при первом пуше - надо будет залогиниться с помощью токена


public class Lesson5 {


}
